# ----------------------------------------
# Keeping myself organised

cask '1password'
mas 'Bear', id: 1091189122
mas 'Day One', id: 1055511498
mas 'MindNode', id: 1289197285
mas 'Numbers', id: 409203825
mas 'OmniGraffle', id: 1142578753
mas 'Pages', id: 409201541
mas 'Things', id: 904280696

# ----------------------------------------
# Helpful utilities

mas 'Amphetamine', id: 937984704
cask 'appcleaner'
mas 'Hidden Bar', id: 1452453066
cask 'scroll-reverser'
cask 'the-unarchiver'
cask 'tripmode'

# ----------------------------------------
# Browsers

cask 'firefox'
cask 'google-chrome'

# ----------------------------------------
# Safari extensions

mas '1Password for Safari', id: 1569813296
mas 'Ghostery – Privacy Ad Blocker', id: 1436953057
mas 'Hush', id: 1544743900
mas 'Save to Pocket', id: 1477385213

# ----------------------------------------
# Teh socials

mas 'Messenger', id: 1480068668
cask 'signal'
mas 'Slack', id: 803453959
cask 'zoom'

# ----------------------------------------
# Music and photos

cask 'adobe-creative-cloud'
mas 'Logic Pro X', id: 634148309
cask 'midikeys'
cask 'midi-monitor'
cask 'splice'
cask 'sysex-librarian'

# ----------------------------------------
# Coding

brew 'asdf'
brew 'gpg'  # Needed for the asdf-nodejs plugin.
brew 'gawk' # Ditto.

cask 'iterm2'
brew 'neovim'
cask 'visual-studio-code'
mas 'Xcode', id: 497799835
cask 'zed'

brew 'gh'
brew 'git'

brew 'lua-language-server' # For better neovim config editing.

tap 'homebrew/cask-fonts'
cask 'font-inconsolata-nerd-font'

# ----------------------------------------
# Helpful command line tools

brew 'entr'
brew 'fd'
brew 'jq'
brew 'ripgrep'

# If we don't list mas explicitly,
# brew bundle cleanup will remove it.
brew 'mas'
