tap 'caskroom/cask'
tap 'homebrew/services'

brew 'awscli'
brew 'chruby'
brew 'docker'
brew 'entr'
brew 'forego'
brew 'git'
brew 'go'
brew 'heroku'
brew 'hub'
brew 'libyaml'
brew 'mas'
brew 'neovim'
brew 'node-build'
brew 'nodenv'
brew 'postgresql'
brew 'redis'
brew 'ripgrep'
brew 'ruby-install'
brew 'watchman'

# Mac apps, installed with https://caskroom.github.io/
cask 'appcleaner'
cask 'aws-vault'
cask 'caffeine'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'free-ruler'
cask 'google-chrome'
cask 'iterm2'
cask 'licecap'
cask 'muzzle'
cask 'omnigraffle'
cask 'sysex-librarian'
cask 'the-unarchiver'
cask 'tripmode'
# cask 'virtualbox'
# cask 'visual-studio-code'

# App store apps, installed with https://github.com/argon/mas
mas '1Password 7', id: 1333542190
mas 'Monosnap', id: 540348655
mas 'Quiver', id: 866773894
mas 'Slack', id: 803453959
mas 'Things3', id: 904280696
mas 'Tomato One', id: 907364780
mas 'Unsplash Wallpapers', id: 1284863847
