# ----------------------------------------------------------------------
# Tools

tap 'github/gh'
brew 'github/gh/gh'
brew 'git'
brew 'hub'
brew 'neovim'
cask 'visual-studio-code'
brew 'entr'
brew 'ripgrep'
brew 'jq'
brew 'zsh'

# ----------------------------------------------------------------------
# Languages

brew 'chruby'
brew 'libyaml'
brew 'ruby-install'

brew 'nodenv'
brew 'node-build'

# ----------------------------------------------------------------------
# Work stuff

cask 'aws-vault'
brew 'awscli'
# brew 'docker'
# cask 'docker'
brew 'forego'
# brew 'go'
tap 'heroku/brew'
brew 'heroku/brew/heroku'
brew 'iamy'
brew 'postgresql@9.6'
cask 'react-native-debugger'
brew 'redis'
tap 'getsentry/tools'
brew 'getsentry/tools/sentry-cli'
brew 'svgo'
brew 'terraform'
brew 'watchman'

# ----------------------------------------------------------------------
# MIDI stuff

# cask 'midi-monitor'
# cask 'sysex-librarian'

# ----------------------------------------------------------------------
# Fonts

tap 'homebrew/cask-fonts'
cask 'font-inconsolata'

# ----------------------------------------------------------------------
# Mac apps, installed with https://caskroom.github.io/

cask 'appcleaner'
cask 'caffeine'
cask 'firefox'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
# cask 'licecap'
cask 'muzzle'
cask 'omnigraffle'
cask 'splice'
cask 'the-unarchiver'
cask 'tripmode'
# cask 'vlc'
# cask 'virtualbox'

# ----------------------------------------------------------------------
# App store apps

brew 'mas'
mas '1Password 7', id: 1333542190
mas 'Bear', id: 1091189122
mas 'Hidden Bar', id: 1452453066
mas 'Logic Pro X', id: 634148309
mas 'Quiver', id: 866773894
mas 'Slack', id: 803453959
mas 'Things', id: 904280696
mas 'Tomato One', id: 907364780
mas 'Unsplash Wallpapers', id: 1284863847
mas 'Xcode', id: 497799835

