# :vim:ft=conf:

cask_args force: true

tap 'homebrew/autoupdate'
tap 'homebrew/services'

# If we don't list mas explicitly, brew bundle cleanup will remove it.
brew 'mas'

# Keeping myself organised ============================================

cask '1password'
mas 'Bear', id: 1091189122
mas 'MindNode', id: 1289197285
mas 'Numbers', id: 409203825
mas 'OmniGraffle', id: 1142578753
mas 'Pages', id: 409201541
mas 'Things', id: 904280696

# Helpful utilities ===================================================

mas 'Amphetamine', id: 937984704
cask 'appcleaner'
cask 'raycast'
cask 'scroll-reverser'
cask 'the-unarchiver'

# Browsers ============================================================

cask 'firefox'
cask 'google-chrome'

# Safari extensions ===================================================

mas '1Password for Safari', id: 1569813296
mas 'Ghostery Privacy Ad Blocker', id: 6504861501
mas 'Save to Pocket', id: 1477385213

# Teh socials =========================================================

mas 'Messenger', id: 1480068668
cask 'signal'
cask 'zoom'

# Music and photos ====================================================

cask 'adobe-creative-cloud'
mas 'Logic Pro X', id: 634148309
cask 'midikeys'
cask 'midi-monitor'
cask 'splice'
cask 'sysex-librarian'

# Coding ==============================================================

brew 'gh'
brew 'git'
cask 'kitty'
brew 'mise'
brew 'neovim'
cask 'swiftformat-for-xcode'
cask 'visual-studio-code'
mas 'Xcode', id: 497799835
cask 'zed'

tap 'homebrew/cask-fonts'
cask 'font-inconsolata-nerd-font'

# Helpful command line tools ==========================================

brew 'bat'
brew 'entr'
brew 'fd'
brew 'fzf'
brew 'jq'
brew 'ripgrep'
brew 'wget'

# mason.nvim needs these to build gems ================================

brew 'coreutils'
brew 'libyaml'
