# :vim:ft=conf:

# If we don't list mas explicitly, brew bundle cleanup will remove it.
brew 'mas'

brew 'bat'
brew 'entr'
brew 'eza'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gpg' # mise uses this to verify packages
brew 'jq'
brew 'lazygit'
brew 'neovim'
brew 'pure'
brew 'ripgrep'
brew 'wget'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

cask_args force: true
cask 'notion'
cask 'obsidian'
cask 'rancher'
cask 'raycast'
cask 'scroll-reverser'
cask 'visual-studio-code'
cask 'zed'

cask 'font-inconsolata-nerd-font'

# mason.nvim needs these to build gems:
brew 'coreutils'
brew 'libyaml'

# nvim-treesitter needs this:
brew 'tree-sitter-cli'
