# If we don't list mas explicitly, brew bundle cleanup will remove it.
brew 'mas'

brew 'entr'
brew 'fd'
brew 'gh'
brew 'git'
brew 'jq'
brew 'mise'
brew 'neovim'
brew 'ripgrep'
brew 'wget'

cask_args force: true
cask 'iterm2'
cask 'kitty'
cask 'notion'
cask 'raycast'
cask 'scroll-reverser'
cask 'visual-studio-code'
cask 'warp'
mas 'Xcode', id: 497799835
cask 'zed'

tap 'homebrew/cask-fonts'
cask 'font-inconsolata-nerd-font'
